GREETINGS = '✈️Добро пожаловать в главное меню чат-бота Управляющей компании "УЭР-ЮГ". Здесь Вы можете оставить заявку для управляющей компании или направить своё предложение по управлению домом. Просто воспользуйтесь кнопками меню, чтобы взаимодействовать с функциями бота.'
CHOOSE_CATEGORY = '📛👇📛Выберите категорию, по которой вы хотите оставить заявку в УК'
STEP_ONE = '<b>Шаг 1/3.</b>📝Напишите адрес или ориентир проблемы(улицу, номер дома, подъезд, этаж и квартиру) или пропустите этот пункт:'
STEP_TWO = '<b>Шаг 2/3.</b> 🖼️Прикрепите фотографию или видео к своей заявке или пропустите этот пункт:'
STEP_THREE = '<b>Шаг 3/3.</b>📛Напишите причину обращения в подробностях'
BID_ACCEPTED = '✅<b>Жалоба отправлена администрации.</b> <i>Спасибо за ваше обращение!</i>'
REGISTRATION = '☀️<b>Доброго времени суток</b>, бот создан, чтобы обрабатывать заявки и обращения пользователей. Чтобы воспользоваться этим, пришлите для начала Ваше <b>Имя</b> и <b>Фамилию</b>'
PHONE = '📞Теперь отправьте Ваш <b>номер телефона</b> через <b>+7</b> следующим сообщением:'
PHONE_INCORRECT = '⛔️📛⛔️<b>Номер телефона</b> должен содержать 11 цифр и должен обязательно содержать в начале <b>+7.Учтите формат и попробуйте снова:</b>'
NAME_INCORRECT = '⛔️📛<b>Имя</b> и <b>Фамилия</b> должны быть введены через один <i>пробел</i>, и должны быть написаны через <i>кириллицу</i>. Также должны быть <i>заглавные буквы</i>. <b>Учтите формат и попробуйте снова:</b>'
SEND_PHOTO = '⛔️📛В данном пункте нужно обязательно отправить <b>фотографию</b> или <b>видео</b> в виде медиа-сообщения.<b>Попробуйте ещё раз:</b>'
CONTENT_TYPES = ['text', 'audio', 'animation', 'document', 'game', 'sticker', 
                 'video_note', 'voice', 'contact', 'venue', 'location', 'poll',
                 'dice', 'new_chat_members', 'left_chat_member', 'invoice', 
                 'successful_payment', 'connected_website',
                 'message_auto_delete_timer_changed', 'migrate_from_chat_id',
                 'migrate_to_chat_id', 'pinned_message', 'new_chat_title', 
                 'new_chat_photo', 'delete_chat_photo', 'group_chat_created',
                 'passport_data', 'proximity_alert_triggered', 
                 'voice_chat_scheduled', 'voice_chat_started',
                 'voice_chat_ended', 'voice_chat_participants_invited',
                 'web_app_data', 'video_chat_scheduled', 'video_chat_started',
                 'video_chat_ended', 'video_chat_participants_invited']
CONTACTS = '<u>Управляющая компания:</u>\n<b>Диспетчерская служба ООО "УЭР-ЮГ"</b>\n+7 4722 35-50-06\n<b>Инженеры ООО "УЭР-ЮГ"</b>\n+7 920 566-28-86\n<b>Бухгалтерия ООО "УЭР-ЮГ"</b>\n+7 4722 35-50-06\n<i>Белгород, Свято-Троицкий б-р, д. 15, подъезд №1</i>\n\n<u>Телефоны для открытия ворот и шлагбаума:</u>\n<b>Шлагбаум "Набережная"</b>\n+7 920 554-87-74\n<b>Ворота "Харьковские"</b>\n+7 920 554-87-40\n<b>Ворота "Мост"</b>\n+7 920 554-64-06\n<b>Калитка 1 "Мост"</b>\n+7 920 554-42-10\n<b>Калитка 2 "Мост"</b>\n+7 920 554-89-04\n<b>Калитка 3 "Харьковская"</b>\n+7 920 554-87-39\n<b>Калитка 4 "Харьковская"</b>\n+7 920 554-89-02\n\n<b>Охрана</b>+7 915 57-91-457\n\n<b>Участковый</b>\nКуленцова Марина Владимировна\n+7 999 421-53-72'
CHOOSE_TYPE_CONNECT = '👇<i>Выберите способ связи из нижеперечисленного списка:</i>'
DISPATCHER = '✅📞✅Добрый день! Я - диспетчер управляющей компании "УЭР-ЮГ", готов помочь Вам. Напишите, пожалуйста, интересующий Вас вопрос и ожидайте'
ADMIN_CALL = '✅<b>Отлично!</b> Наш диспетчер перезвонит Вам в ближайшее время.'
DIALOG_CLOSED = '❌📞<b>Диалог с администратором завершён...</b>'
SETTINGS = '⚙️Тут вы сможете поменять <b>Имя</b> и <b>Фамилию</b> в Базе данных нашего бота или же можете поменять Ваш <b>номер телефона</b>, если Вы изначально вводили что-то неверно. Выберите, что хотите поменять или вернитесь назад в <b><i>главное меню:</i></b>'
CHANGE_NAME = '🛠<i>Отправьте своё Имя и Фамилию, чтобы поменять настройки:</i>'
NEW_NAME = '🛠✅🛠Настройки <b>имени</b> успешно применены!'
CHANGE_PHONE = '🛠<i>Отправьте свой номер телефона, чтобы поменять настройки:</i>'
NEW_PHONE = '🛠✅🛠Настройки <b>номера</b> успешно применены!'
GET_PROPOSAL = '💡<b>Распишите Ваше предложение в подробностях: (Добавьте фотографию, если есть)</b>'
PROPOSAL_ACCEPTED = '✅💡<b>Идея принята и передана администрации.</b><i> Спасибо за Ваше обращение!</i>'
ADMIN_PANEL = '👑Добро пожаловать в <b>админ-панель</b>. Выберите действие:'